[
    {
      "trf_long_description": "Earn $5 back on your Showtime purchase Get instant access to commercial-free SHOWTIME original series, including Billions, The Chi, and Black Monday, plus hit Hollywood movies, documentaries, combat sports and more. Watch live TV or catch up on demand on your TV, tablet, phone or computer. You can also download full episodes and movies to your mobile devices and watch them offline, wherever and whenever. Offer expires 9/30/2022. Offer valid one time only. Offer not valid on third-party services. Payment must be made on or before offer expiration date."
    },
    {
      "trf_long_description": "Offer subject to merchant and program terms. For Cash Back Online Shopping Offers: If a merchant processes your order in separate transactions, you'll only earn cash back value on the first transaction. Earn $5 cash back on your Misfits Market purchase. Misfits Market is an affordable online grocery service that fights food waste. We source organic produce and high-quality pantry staples directly from farmers and makers, then deliver them to your door at up to 40% off grocery store prices. Skip the trip to the store and enjoy fresh, healthy food at home while you help fix the food system. Offer expires 10/25/2022. Offer valid one time only. Offer not valid on third-party services. Payment must be made on or before offer expiration date."
    },
    {
      "trf_long_description": "Details and Terms Earn $3 cash back on your new Peacock Premium subscription!Get Peacock and stream hundreds of movies, your favorite TV series, and exclusive Originals — plus the latest in news, sports, and pop culture, updated daily. Get StartedOffer expires 11/30/2022. Payment must be made directly with the merchant. Offer not valid on subscriptions through other providers. New Premium and Premium Plus subscribers only. Offer valid one time only."
    },
    {
      "trf_long_description": "Earn $1 back on any subscription. News of tomorrow, today. Stay informed with WIRED. WIRED explores the ways technology is changing our lives - from culture to business, science to design. With a WIRED subscription, you get over 70 new online stories each week, subscriber-only newsletters, and weekly podcasts and video series tailored to your interests. After your initial term, your subscription will automatically renew for one year until you cancel. After your first renewal the term/rate may change. We'll send a notice before renewal with the term/rate in effect. If you do nothing, we'll charge the payment method you chose. Cancel at any time at wired.com/customerservice to get a refund for the portion remaining on your subscription. Current annual rates and information on the terms of your subscription can be found on the checkout page."
    },
    {
      "trf_long_description": "Earn $5 cash back. Up to $5.00 Offer expires 10/26/2022. Offer valid one time only. Offer not valid on third-party services. Payment must be made on or before offer expiration date. Misfits Market is an affordable online grocery service that fights food waste. We source organic produce and high-quality pantry staples directly from farmers and makers, then deliver them to your door at up to 40% off grocery store prices. Skip the trip to the store and enjoy fresh, healthy food at home while you help fix the food system."
    },
    {
      "trf_long_description": "Earn $25 back on your SimpliSafe purchase, when you spend $250 or more.Make home feel safe again with 24/7 protection from SimpliSafe Home Security. Designed by a Harvard-educated engineer, SimpliSafe is an alarm system that has all the tools you need to protect your family with no long-term contracts or hidden fees. Offer expires 11/14/2022. Offer valid one time only. Offer not valid on third-party services. Payment must be made on or before offer expiration date."
    },
    {
      "trf_long_description": "Get a one-time $25 statement credit by using your enrolled eligible Card to make a single purchase of $50 or more online at gainful.com by 11/17/2022. See terms."
    },
    {
      "trf_long_description": "Get a $10 statement credit by using your enrolled eligible Card to make a single purchase of $50 or more online at magnoliabakery.com by 12/31/2022. Limit of 2 statement credits (total of $20). See terms."
    },
    {
      "trf_long_description":"Get a $15 statement credit by using your enrolled eligible Card to spend a minimum of $75 in one or more purchases online at zazzle.com by 12/30/2022. Limit of 2 statement credits (total of $30). See terms."
    },
    {
      "trf_long_description": "Details and Terms Earn $15 cash back on your Wawa Catering purchase when you spend $50 or more.Whatever you’re planning, you can cater it with Wawa. Cater your Wawa favorites from hoagies, soft pretzels and cookies to Sizzlis, donuts and coffee. Order, pay online and choose pick-up or delivery all at WawaCatering.com.Visit SiteOffer expires 12/19/2022. Offer valid one time only. Payment must be made directly with the merchant. Offer only valid on Wawa Catering purchases. Offer not valid on other Wawa purchases. Offer not valid on third-party services. Payment must be made on or before offer expiration date."
    },
    {
      "trf_long_description": "Get a one-time $25 statement credit by using your enrolled eligible Card to spend a minimum of $125 in one or more purchases in-store at Rhone or online at rhone.com by 1/31/2023. See terms."
    },
    {
      "trf_long_description": "Get a $15 statement credit by using your enrolled eligible Card to spend a minimum of $75 in one or more purchases online at zazzle.com by 12/30/2022. Limit of 2 statement credits (total of $30). See terms."
    },
    {
      "trf_long_description": "Get 20% back as a one-time statement credit by using your enrolled eligible Card to make a single purchase of $50 or more in-store at The Tuck Room by 12/30/2022. See terms."
    },
    {
      "trf_long_description": "Details and Terms Earn 10% cash back on all of your Casper purchases when you spend $350 or more, until a $65.00 cash back maximum is reached.Founded in 2014, Casper launched with the mission to re-imagine sleep from the ground up. America's award-winning mattress brand, Casper's sleep products are developed in-house by our R&D team. The Casper mattress combines high density memory foam with a top layer of open cell foam to create a sleep surface that contours to your body and keeps you cool through the night. Plus, it ships for free in a 'how did they do that?' sized box. Try it risk free for 100 nights.View us at www.casper.com Offer expires 11/30/2022. Payment must be made directly with the merchant. Offer not valid on Casper products purchased through other retailers. Offer not valid on third-party services. Payment must be made on or before offer expiration date."
    },
    {
      "trf_long_description": "Earn 30% back on a purchase of $70 or more. Hungryroot is your personal grocer, powered by AI and the belief that food deeply impacts your daily life. You tell us a little about yourself, and we deliver healthy groceries to your door each week with recipes and meal planning support. Hungryroot helps you save time, save money, shop sustainably, and eat what makes you feel your best. Valid on a minimum purchase of $70. Offer expires 11/30/2022. Offer excludes taxes. Not valid with other offers. Offer valid online only and may be redeemed once."
    },
    {
      "trf_long_description": "Earn 20% back on your GameStop purchase, with a $10.00 back maximum. Offer expires 9/4/2022. Offer valid one time only. Offer not valid on third-party services. Payment must be made on or before offer expiration date."
    },
    {
      "trf_long_description": "Get 20% back as a one-time statement credit by using your enrolled eligible Card to make a single purchase of a MasterClass annual membership online at masterclass.com by 11/14/2022. See terms."
    },
    {
      "trf_long_description": "Offer subject to merchant and program terms. For Cash Back Online Shopping Offers: If a merchant processes your order in separate transactions, you'll only earn cash back value on the first transaction. Earn 10% cash back on your Panera Bread purchase, with a $2.00 cash back maximum. Dinner with Panera freshly prepared with clean ingredients is a feast for the senses. The rich flavors of a Baja Bowl. The warm aroma of the roasted chicken. The feel of fontina on a Chipotle Chicken & Bacon Flatbread Pizza. The taste of smoky aioli. It’s a night off from cooking. And a night on for your senses. Dinner made fantastic by Panera. Stop by your local Panera Cafe or get $1 delivery when you order Dinner on the Panera app. Offer expires 10/8/2022. Offer valid one time only. Offer not valid on third-party services. Payment must be made on or before offer expiration date."
    },
    {
      "trf_long_description": "Details and Terms Earn 10% cash back on your Cozy Earth purchase, with a $44.00 cash back maximum.Cozy Earth delivers unparalleled sleep and leisure; creating the world's softest, highest quality bedding, loungewear and home goods - providing temperature regulation and luxury through ethically sourced materials.Shop Cozy Earth.Offer expires 12/20/2022. Offer valid one time only. Payment must be made directly with the merchant. Offer not valid on Cozy Earth products purchased through other retailers. Offer not valid on third-party services. Payment must be made on or before offer expiration date."
    },
    {
      "trf_long_description": "Earn 15% back on any purchase. Shop FTD.com/clo for flowers & gifts and earn a 15% statement credit. With a large selection of bouquets and unparalleled network of local florists across the country, FTD is America's oldest and most trusted source for flowers and gifts. From condolences to congratulations, birthdays or just because, FTD empowers you to give with meaning for any occasion. Purchase must be made at www.ftd.com/clo using your registered Mastercard to qualify. Not combinable with other discounts or promotions. Maximum award $75. Returns, cancellations, and refunds are not eligible for statement credit."
    },
    {
      "trf_long_description": "Earn 10% back on any purchase. 10% back on your purchase on the Burger King® App or BK.com, maximum award of $2. May be redeemed 3x by the offer end date. Enjoy further the flame-grilled taste of the Whopper® and the Burger King® menu when you order online. Earn 10% back on any purchase, up to a maximum $2 statement credit. Limited time only on the BK® App and bk.com. Account registration required. Not valid in AK, HI & U.S. territories. Not valid on 3rd party delivery orders. Royal Perks terms apply: bk.com/rewards-terms. Burger King® and BK® are trademarks of Burger King Corporation. Used under license. Offer is nontransferable and the enrolled card must be active and in good-standing in order to be eligible for a statement credit. Offers cannot be combined or stacked with other offers. Other exclusions and restrictions may apply. We may determine that certain offers are ineligible for statement credit. Mastercard may, in our sole discretion, suspend or deny your eligibility for all or part of the Merchant Offers Program at any time without advanced notice to you."
    },
    {
      "trf_long_description": "Earn 30% back on any purchase. Enjoy award-winning Wine-In-A-Can delivered straight to your door! Receive 30% back in statement credit up to $30, for any purchase on grahamandfisk.com. Choose any of our 4 delicious blends (or try them all!): Rosé with Bubbles, White with Bubbles, Red, and still White. 100% California wine in a go-to package at a 12.5% ABV! Keep the entire party at ease with blends to suit any occasion. Valid for any purchase on our site, including taxes and after any discounts at grahamandfisk.com. May be redeemed up to 2 times. Offer only valid for a qualifying purchase online at grahamandfisk.com. Excludes physical and online authorized retailers and resellers. Permitted shipping states may vary within the United States. Must be 21 or older to purchase from grahamandfisk.com. Please drink responsibly."
    },
    {
      "trf_long_description": "Earn 10% cash back. Up to $9.00 Offer expires 10/21/2022. Offer not valid on third-party services. Payment must be made on or before offer expiration date. It's our mission to redefine luxury beauty by creating amazing products at prices that don't break the bank. We pride ourselves on being cruelty-free, wallet-friendly, and keeping our customers at the center of our world. Shop everything from eye, face and lip makeup to skincare and body products."
    },
    {
      "trf_long_description": "Earn 10% cash back. Up to $3.00 Offer expires 11/27/2022. Offer valid one time only. Offer not valid on third-party services. Payment must be made on or before offer expiration date. Roll with Lyft and save on your next ride. Take a ride and save. Your wallet will thank you."
    },
    {
      "trf_long_description": "Earn 10% back on all of your Best Buy purchases, until a $25.00 back maximum is reached.View the website to shop online or find a location near you.Offer expires 9/22/2022. Offer not valid on third-party services or mobile wallet purchases."
    },
    {
      "trf_long_description": "Get 4% back as a statement credit by using your enrolled eligible Card to make purchases in-store at Francesca's by 10/31/2022. Limit of $250 back in total statement credits. See terms."
    },
    {
      "trf_long_description": "Offer subject to merchant and program terms. For Cash Back Online Shopping Offers: If a merchant processes your order in separate transactions, you'll only earn cash back value on the first transaction. Earn 15% cash back on all of your Pet Supplies Plus purchases, until a $7.50 cash back maximum is reached. At Pet Supplies Plus it’s easy to find everything you need for all of your furry, scaly & feathery friends. Our local stores are smaller by choice and our shelves are stocked with just the right products, specifically chosen to help keep them happy and healthy. With our free curbside pickup your order can be ready in less than 1 hour, so you can put more play back in your day! Offer expires 9/15/2022. Offer not valid on third-party services. Payment must be made on or before offer expiration date."
    },
    {
      "trf_long_description": "Details and Terms Earn 10% cash back on all of your Overstock purchases, until a $45.00 cash back maximum is reached.At Overstock, home is a big deal. We offer stylish furniture and décor for an affordable price in our mission to create dream homes for all. It’s quality and style at a smart value.Shop Here. Offer expires 11/15/2022. Payment must be made directly with the merchant. Offer not valid on third-party services. Payment must be made on or before offer expiration date."
    }
  ]